In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.DataFrame(np.arange(6).reshape(2,3),
                   columns=list("ABC"),
                   index=["Tim", "Tom"])

df2 = pd.DataFrame(np.arange(9).reshape(3,3),
                   columns=list("ACD"),
                   index=["Tim", "Kate", "Tom"])

In [3]:
print(df1)

     A  B  C
Tim  0  1  2
Tom  3  4  5

In [4]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [5]:
df1 + df2

        A   B     C   D
Kate  NaN NaN   NaN NaN
Tim   0.0 NaN   3.0 NaN
Tom   9.0 NaN  12.0 NaN

In [6]:
df1.add(df2, fill_value=0)

        A    B     C    D
Kate  3.0  NaN   4.0  5.0
Tim   0.0  1.0   3.0  2.0
Tom   9.0  4.0  12.0  8.0

In [7]:
df1.mul(3)

     A   B   C
Tim  0   3   6
Tom  9  12  15

In [8]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [9]:
second_row = df2.iloc[1]
second_row

A    3
C    4
D    5
Name: Kate, dtype: int64

In [10]:
df2 - second_row

      A  C  D
Tim  -3 -3 -3
Kate  0  0  0
Tom   3  3  3

In [11]:
second_column = df2["C"]
second_column

Tim     1
Kate    4
Tom     7
Name: C, dtype: int64

In [12]:
df2.sub(second_column, axis="index")

      A  C  D
Tim  -1  0  1
Kate -1  0  1
Tom  -1  0  1

In [13]:
df2

      A  C  D
Tim   0  1  2
Kate  3  4  5
Tom   6  7  8

In [14]:
def square(x):
    return x**2

In [16]:
df2.apply(square)

       A   C   D
Tim    0   1   4
Kate   9  16  25
Tom   36  49  64